presentations/intro-to/git.org
#+TITLE:The Git version control system
#+OPTIONS: toc:nil reveal_width:1200 reveal_height:1080 num:nil
#+REVEAL_ROOT: ../reveal.js
#+REVEAL_TITLE_SLIDE: <h1>%t</h1><h3>%s</h3><h2>By %A %a</h2><h3><i>git commit -am "Totally a profesional developer"</i></h3><p>Press s for speaker notes</p>
#+REVEAL_THEME: black
#+REVEAL_TRANS: slide

#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage[top=1cm,left=3cm,right=3cm]{geometry}

* What is version control?
#+begin_notes
version control is a way to manage and back up source code
It is the industry standard practice to keep code under some kind of version
control and the most widly used VCS is called git. you have probably heard of it
from services such as github and gitlab.

- breaking code changes into revisions or "commits" each identifyable using a
  uniqe hash.
- allowing for people to non destructivly make copys of the code and merge them
  in when developed
- facilitating the ability to checkout and roll back commits
- push the source code to a remote for backups
#+end_notes

#+ATTR_REVEAL: :frag (roll-in)
- *Some features of Version control:*
- breaking code changes into revisions or "commits" each identifiable using a
  unique hash.
- allowing for people to non destructively make copies of the code and merge them
  in when developed.
- facilitating the ability to checkout and roll back commits thorughout gits
  history
- push the source code to a remote for backups and easy sharing of the source
  code.

* Why use Version control? (git)
#+begin_notes
other than it being the industry standard it also has a lot of benefits such as
- Breaking up code revisions into smaller chunks called "commits"
  which makes it easier to see how the code base changed over time
- Allowing you to roll back commits for whatever reason
  git also provides tools to find the last good commit called bisecting
- Allowing you to change your code base without affecting a master copy of your
  code
  Meaning you can add features and merge them in when they are ready while also
  shipping a stable version
- making it easier to collaborate and scale your code base to include more people
- as well as other benefits
#+end_notes

#+ATTR_REVEAL: :frag (roll-in)
- Breaking up code revisions into smaller chunks called "commits"
- Allowing you to roll back commits for whatever reason
- Allowing you to change your code base without affecting a master copy of your
- Making it easier to collaborate and scale your code base to include more people

* Some concepts
** Starting off
*** init
#+begin_notes
Lets say you need to start a project you can just do a git init to initialise an
empty git repository
#+end_notes
#+begin_src bash
$ git init
#+end_src
*** clone
#+begin_notes
If you need to work on some other project or reclone one you have already
started then you can use the clone command
#+end_notes

#+begin_src bash
$ git clone https://some.website/repo.git
# eg
$ git clone https://github.com/jeetelongname/example.git # you can actually clone this
#+end_src
*** status
#+begin_notes
git status tells you what is happening in your repository. it will tell you what
is staged what needs commiting and so on
#+end_notes

#+begin_src bash
git status
#+end_src

** Staging
#+begin_notes
Staging is the git term for getting files ready for commits. When you need to
add new changes you need to add the file to the stage before commiting it. This
may seem tedios but means you don't need to commit all of your changes by one go
and commit based on the task you are completing.
#+end_notes
*** add
#+begin_notes
To add a file / your changes to a file you use the git add command you specify
the file you want to add.

too add all of your changes you can use the . symbol (which stands for the
current directory as we discussed from our last lesson)
#+end_notes
#+begin_src bash
git add file

git add .
#+end_src

*** reset
#+begin_notes
To remove a file you can use the reset command. provide it with a file and it
will unstage the file. to unstage all files you just don't provide it with an
argument
#+end_notes

#+begin_src bash
git revert file # removes file from the stage

git revert # removes all staged changes
#+end_src
