presentations/intro-to/git.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>The Git version control system</title>
<meta name="author" content="Jeetaditya Chatterjee"/>
<link rel="stylesheet" href="../reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="../reveal.js/dist/theme/black.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>The Git version control system</h1><h3></h3><h2>By  Jeetaditya Chatterjee</h2><h3><i>git commit -am "Totally a profesional developer"</i></h3><p>Press s for speaker notes</p>
</section>

<section>
<section id="slide-org8ad0e52">
<h2 id="org8ad0e52">What is version control?</h2>
<aside class="notes">
<p>
version control is a way to manage and back up source code
It is the industry standard practice to keep code under some kind of version
control and the most widly used VCS is called git. you have probably heard of it
from services such as github and gitlab.
</p>

<ul>
<li>breaking code changes into revisions or &ldquo;commits&rdquo; each identifyable using a
uniqe hash.</li>
<li>allowing for people to non destructivly make copys of the code and merge them
in when developed</li>
<li>facilitating the ability to checkout and roll back commits</li>
<li>push the source code to a remote for backups</li>

</ul>

</aside>

<ul>
<li class="fragment roll-in"><b>Some features of Version control:</b></li>
<li class="fragment roll-in">breaking code changes into revisions or &ldquo;commits&rdquo; each identifiable using a
unique hash.</li>
<li class="fragment roll-in">allowing for people to non destructively make copies of the code and merge them
in when developed.</li>
<li class="fragment roll-in">facilitating the ability to checkout and roll back commits thorughout gits
history</li>
<li class="fragment roll-in">push the source code to a remote for backups and easy sharing of the source
code.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgdd729d3">
<h2 id="orgdd729d3">Why use Version control? (git)</h2>
<aside class="notes">
<p>
other than it being the industry standard it also has a lot of benefits such as
</p>
<ul>
<li>Breaking up code revisions into smaller chunks called &ldquo;commits&rdquo;
which makes it easier to see how the code base changed over time</li>
<li>Allowing you to roll back commits for whatever reason
git also provides tools to find the last good commit called bisecting</li>
<li>Allowing you to change your code base without affecting a master copy of your
code
Meaning you can add features and merge them in when they are ready while also
shipping a stable version</li>
<li>making it easier to collaborate and scale your code base to include more people</li>
<li>as well as other benefits</li>

</ul>

</aside>

<ul>
<li class="fragment roll-in">Breaking up code revisions into smaller chunks called &ldquo;commits&rdquo;</li>
<li class="fragment roll-in">Allowing you to roll back commits for whatever reason</li>
<li class="fragment roll-in">Allowing you to change your code base without affecting a master copy of your</li>
<li class="fragment roll-in">Making it easier to collaborate and scale your code base to include more people</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgd1425ef">
<h2 id="orgd1425ef">Some concepts</h2>
<div class="outline-text-2" id="text-orgd1425ef">
</div>
</section>
<section id="slide-orgfbc341d">
<h3 id="orgfbc341d">Starting off</h3>
<div class="outline-text-3" id="text-orgfbc341d">
</div>
</section>
<section id="slide-org41f7980">
<h4 id="org41f7980">init</h4>
<aside class="notes">
<p>
Lets say you need to start a project you can just do a git init to initialise an
empty git repository
</p>

</aside>
<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">git</span> init
</pre>
</div>
</section>
<section id="slide-org8ccdf4d">
<h4 id="org8ccdf4d">clone</h4>
<aside class="notes">
<p>
If you need to work on some other project or reclone one you have already
started then you can use the clone command
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">git</span> clone https://some.website/repo.git
<span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">eg</span>
$ <span style="color: #21bfc2;">git</span> clone https://github.com/jeetelongname/example.git <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">you can actually clone this</span>
</pre>
</div>
</section>
<section id="slide-org2505063">
<h4 id="org2505063">status</h4>
<aside class="notes">
<p>
git status tells you what is happening in your repository. it will tell you what
is staged what needs commiting and so on
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> status
</pre>
</div>

</section>
<section id="slide-org137c9f9">
<h3 id="org137c9f9">Staging</h3>
<aside class="notes">
<p>
Staging is the git term for getting files ready for commits. When you need to
add new changes you need to add the file to the stage before commiting it. This
may seem tedios but means you don&rsquo;t need to commit all of your changes by one go
and commit based on the task you are completing.
</p>

</aside>
</section>
<section id="slide-orgfd7c7f1">
<h4 id="orgfd7c7f1">add</h4>
<aside class="notes">
<p>
To add a file / your changes to a file you use the git add command you specify
the file you want to add.
</p>

<p>
too add all of your changes you can use the . symbol (which stands for the
current directory as we discussed from our last lesson)
</p>

</aside>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> add file

<span style="color: #21bfc2;">git</span> add .
</pre>
</div>

</section>
<section id="slide-org208afe5">
<h4 id="org208afe5">reset</h4>
<aside class="notes">
<p>
To remove a file you can use the reset command. provide it with a file and it
will unstage the file. to unstage all files you just don&rsquo;t provide it with an
argument
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> revert file <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">removes file from the stage</span>

<span style="color: #21bfc2;">git</span> revert <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">removes all staged changes</span>
</pre>
</div>
</section>
