presentations/intro-to/git.org
** Commits
#+begin_notes
We have discussed the precursor to commiting so now we need to actually commit
to it

A git commit is a collection of changes that will be added to your git history.
commits represent the backbone of git and its important you make your commits
small and to the point. don't try and stuff too many features into one commit as
you lose a lot of the benefits of git. (as a rule of thumb try and keep each
commit down to one fix or feature. eg a small bug fix or the addition of a
function)
#+end_notes
*** commit
#+begin_notes
To create a commit you call the ~commit~ command. this will open up an editor for
you to then type in a commit message. I won't go deep into commit etiquette but I
recommend you search conventional commits as it provides a good framework for
commit messages

There are 2 flags that are useful but not recommended for proper projects
the -a flag which commits all changes in the current directory
and the -m flag which will allow you to type a message inline without using an
editor.
#+end_notes

#+begin_src bash
git commit # opens an editor where you type a message

git commit -a # commit all changes
git commit -m "commit message provided here"
#+end_src
** Branches
#+begin_notes
Branching is another really powerful feature of git. It allows you to make
sweeping changes to your code without damaging the master copy of your code.

Branches are cheap to make (taking up very little space) meaning you have no
reason to use them!

The main use of branches is to separate stable code from new features or bug
fixes. This allows you to change the code to your hearts content without
damaging your main copy
#+end_notes
*** branch
#+begin_notes
creating branches is quite easy. you just call the branch command and it will
create a branch starting at the current branch. You can speify a different
branch by providing it

to delete a branch you add the -d flag

If there are unmerged changes and the branch is not backed up you will need to
force git by using the -D flag
#+end_notes

#+begin_src bash
git branch <branch_name>

git branch <branch_name> <base_branch_name>


git branch -d <branch_name>

git branch -D <branch_name>
#+end_src
*** checkout
#+begin_notes
We have created branches but now we need to use them so we use the checkout
command

git actually has a shortcut to create a new branch and switch to it. by adding
the -b flag to the checkout command you can create a new branch there and then
#+end_notes

#+begin_src bash
git checkout <branch_name> # switch to that branch

git checkout -b <new_branch_name>
#+end_src
** Merging
#+begin_notes
Now that we have these branches we need to actually do somthing with them.. we
discussed deleting them but thats not that useful. We need a way to merge them
and update them as time goes on
#+end_notes
*** merge
#+begin_notes
merging takes the commits of the provided beach and /merges/ them into the current
branch by making a merge commit. this tells git what commits have been merged
into the current branch. As its a commit if you are not happy with the merge you
can rollback the commit like any other. This is also known as non destructive
merging

the problem here is that there will be a commit everytime you merge the branch
which can make the history of the branch messy and not that great. that is where
the next kind of merging comes into play
#+end_notes

#+begin_src bash
git checkout master
git merge feature # merge feature into master

git merge master feature # merge feature into master
#+end_src

