presentations/intro-to/git.html
<section id="slide-org58484eb">
<h3 id="org58484eb">Commits</h3>
<aside class="notes">
<p>
We have discussed the precursor to commiting so now we need to actually commit
to it
</p>

<p>
A git commit is a collection of changes that will be added to your git history.
commits represent the backbone of git and its important you make your commits
small and to the point. don&rsquo;t try and stuff too many features into one commit as
you lose a lot of the benefits of git. (as a rule of thumb try and keep each
commit down to one fix or feature. eg a small bug fix or the addition of a
function)
</p>

</aside>
</section>
<section id="slide-org9c5553f">
<h4 id="org9c5553f">commit</h4>
<aside class="notes">
<p>
To create a commit you call the <code>commit</code> command. this will open up an editor for
you to then type in a commit message. I won&rsquo;t go deep into commit etiquette but I
recommend you search conventional commits as it provides a good framework for
commit messages
</p>

<p>
There are 2 flags that are useful but not recommended for proper projects
the -a flag which commits all changes in the current directory
and the -m flag which will allow you to type a message inline without using an
editor.
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> commit <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">opens an editor where you type a message</span>

<span style="color: #21bfc2;">git</span> commit -a <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">commit all changes</span>
<span style="color: #21bfc2;">git</span> commit -m <span style="color: #fab795;">"commit message provided here"</span>
</pre>
</div>
</section>
<section id="slide-org6ecfc5f">
<h3 id="org6ecfc5f">Branches</h3>
<aside class="notes">
<p>
Branching is another really powerful feature of git. It allows you to make
sweeping changes to your code without damaging the master copy of your code.
</p>

<p>
Branches are cheap to make (taking up very little space) meaning you have no
reason to use them!
</p>

<p>
The main use of branches is to separate stable code from new features or bug
fixes. This allows you to change the code to your hearts content without
damaging your main copy
</p>

</aside>
</section>
<section id="slide-org598c805">
<h4 id="org598c805">branch</h4>
<aside class="notes">
<p>
creating branches is quite easy. you just call the branch command and it will
create a branch starting at the current branch. You can speify a different
branch by providing it
</p>

<p>
to delete a branch you add the -d flag
</p>

<p>
If there are unmerged changes and the branch is not backed up you will need to
force git by using the -D flag
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> branch &lt;branch_name&gt;

<span style="color: #21bfc2;">git</span> branch &lt;branch_name&gt; &lt;base_branch_name&gt;


<span style="color: #21bfc2;">git</span> branch -d &lt;branch_name&gt;

<span style="color: #21bfc2;">git</span> branch -D &lt;branch_name&gt;
</pre>
</div>
</section>
<section id="slide-orgee6ee3b">
<h4 id="orgee6ee3b">checkout</h4>
<aside class="notes">
<p>
We have created branches but now we need to use them so we use the checkout
command
</p>

<p>
git actually has a shortcut to create a new branch and switch to it. by adding
the -b flag to the checkout command you can create a new branch there and then
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> checkout &lt;branch_name&gt; <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">switch to that branch</span>

<span style="color: #21bfc2;">git</span> checkout -b &lt;new_branch_name&gt;
</pre>
</div>
</section>
<section id="slide-orgf9b5ff0">
<h3 id="orgf9b5ff0">Merging</h3>
<aside class="notes">
<p>
Now that we have these branches we need to actually do somthing with them.. we
discussed deleting them but thats not that useful. We need a way to merge them
and update them as time goes on
</p>

</aside>
</section>
<section id="slide-org8ad5728">
<h4 id="org8ad5728">merge</h4>
<aside class="notes">
<p>
merging takes the commits of the provided beach and <i>merges</i> them into the current
branch by making a merge commit. this tells git what commits have been merged
into the current branch. As its a commit if you are not happy with the merge you
can rollback the commit like any other. This is also known as non destructive
merging
</p>

<p>
the problem here is that there will be a commit everytime you merge the branch
which can make the history of the branch messy and not that great. that is where
the next kind of merging comes into play
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> checkout master
<span style="color: #21bfc2;">git</span> merge feature <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">merge feature into master</span>

<span style="color: #21bfc2;">git</span> merge master feature <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">merge feature into master</span>
</pre>
</div>

</section>
