presentations/intro-to/git.tex

\subsection*{Commits}
\label{sec:org5b0f106}
\begin{notes}
We have discussed the precursor to committing so now we need to actually commit
to it

A git commit is a collection of changes that will be added to your git history.
commits represent the backbone of git and its important you make your commits
small and to the point. don't try and stuff too many features into one commit as
you lose a lot of the benefits of git. (as a rule of thumb try and keep each
commit down to one fix or feature. eg a small bug fix or the addition of a
function)
\end{notes}
\subsubsection*{commit}
\label{sec:orgec0c747}
\begin{notes}
To create a commit you call the \texttt{commit} command. this will open up an editor for
you to then type in a commit message. I won't go deep into commit etiquette but I
recommend you search conventional commits as it provides a good framework for
commit messages

There are 2 flags that are useful but not recommended for proper projects
the -a flag which commits all changes in the current directory
and the -m flag which will allow you to type a message inline without using an
editor.
\end{notes}

\begin{verbatim}
git commit # opens an editor where you type a message

git commit -a # commit all changes
git commit -m "commit message provided here"
\end{verbatim}
\subsection*{Branches}
\label{sec:org8b8ce90}
\begin{notes}
Branching is another really powerful feature of git. It allows you to make
sweeping changes to your code without damaging the master copy of your code.

Branches are cheap to make (taking up very little space) meaning you have no
reason to use them!

The main use of branches is to separate stable code from new features or bug
fixes. This allows you to change the code to your hearts content without
damaging your main copy
\end{notes}
\subsubsection*{branch}
\label{sec:orgd91dfe5}
\begin{notes}
creating branches is quite easy. you just call the branch command and it will
create a branch starting at the current branch. You can specify a different
branch by providing it

to delete a branch you add the -d flag

If there are unmerged changes and the branch is not backed up you will need to
force git by using the -D flag
\end{notes}

\begin{verbatim}
git branch <branch_name>

git branch <branch_name> <base_branch_name>


git branch -d <branch_name>

git branch -D <branch_name>
\end{verbatim}
\subsubsection*{checkout}
\label{sec:org26d3591}
\begin{notes}
We have created branches but now we need to use them so we use the checkout
command

git actually has a shortcut to create a new branch and switch to it. by adding
the -b flag to the checkout command you can create a new branch there and then
\end{notes}

\begin{verbatim}
git checkout <branch_name> # switch to that branch

git checkout -b <new_branch_name>
\end{verbatim}
\subsection*{Merging}
\label{sec:org6d05186}
\begin{notes}
Now that we have these branches we need to actually do something with them.. we
discussed deleting them but that's not that useful. We need a way to merge them
and update them as time goes on
\end{notes}
\subsubsection*{merge}
\label{sec:org7b786be}
\begin{notes}
merging takes the commits of the provided beach and \emph{merges} them into the current
branch by making a merge commit. this tells git what commits have been merged
into the current branch. As its a commit if you are not happy with the merge you
can rollback the commit like any other. This is also known as non destructive
merging

the problem here is that there will be a commit every time you merge the branch
which can make the history of the branch messy and not that great. that is where
the next kind of merging comes into play
\end{notes}

\begin{verbatim}
git checkout master
git merge feature # merge feature into master

git merge master feature # merge feature into master
\end{verbatim}
