presentations/intro-to/git.html
<section id="slide-orgddd350d">
<h4 id="orgddd350d">rebase</h4>
<aside class="notes">
<p>
rebasing rewrites the history of the current branch to incorporate the changes
of the merging branch. this changes the history of the branch which is pretty
dangerous that being said it also makes the code history much more readable
and makes the project history linear. there are no forks to contend with making
it much easier to follow a projects history.
</p>

<p>
This comes at the cost of safety you are rewriting your history which every time
travel show I have watched has said is a really dangerous thing to do. You also
lose some context provided by the merge commit
</p>

<p>
as for where to use which. I
reccomend you rebase your main branch onto your feature branches and merge your
feature branches into your main. This is what I see happen a lot but this is not
a hard and fast rule
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> checkout feature
<span style="color: #21bfc2;">git</span> rebase master <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">rebase master onto feature</span>

<span style="color: #21bfc2;">git</span> rebase feature master <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">samething but one line</span>
</pre>
</div>

</section>
<section id="slide-org0326aff">
<h3 id="org0326aff">Remotes</h3>
<aside class="notes">
<p>
We have reached another conundrum all of this code is local. We need a way to
get it out into the world. We could put all of this code in a drop box folder
and share that but I think you know that i am going to show you how to use git
to do that
</p>

</aside>
</section>
<section id="slide-orgeb70ffc">
<h4 id="orgeb70ffc">remote</h4>
<aside class="notes">
<p>
A remote is an online location for your code. people upload there code to github
or gitlab some people even host there own server. but all are valid remotes
</p>

<p>
to add one you call the remote add command and provide it with a name and the
url
</p>

<p>
to change the url call the set-url command
</p>

<p>
and then rename and remove are self explanatory
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> remote add &lt;remote_name&gt; https://your.url.here/repo.git

<span style="color: #21bfc2;">git</span> remote add origin https://github.com/jeetelongname/example.git

<span style="color: #21bfc2;">git</span> remote set-url origin https://git.sr.ht/~jeetelongnamr/example.git <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">not real</span>

<span style="color: #21bfc2;">git</span> remote rename orign upstream

<span style="color: #21bfc2;">git</span> remote remove upstream
</pre>
</div>

</section>
<section id="slide-org4c88be6">
<h4 id="org4c88be6">push</h4>
<aside class="notes">
<p>
To send your changes to your new fangled remote you use the push command. it
takes the argument of the remote and the branch to push. when pushing the branch
for the first time you should add the -u flag which tracks the branch
</p>

<p>
You may need to also overwirte the remote for some reason this is risky as you
could lose work other people push.
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> push origin master
<span style="color: #21bfc2;">git</span> push -u origin devel <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">pusing for the first time</span>
<span style="color: #21bfc2;">git</span> push origin master --force <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">overwrite the remote</span>
</pre>
</div>

</section>
<section id="slide-org2618867">
<h4 id="org2618867">fetch</h4>
<aside class="notes">
<p>
git fetch will download the files from a remote without doing anything with
them. This allows you to look at what other people are doing without
affecting your local copy. you can then merge it into your local copy later if
you wish.
</p>

<p>
note when you check out <code>some-branch</code> you will be in a detached head state which
means that you can edit all of this and it will not affect your history
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> fetch origin <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">fetch all of the branches named origin</span>
<span style="color: #21bfc2;">git</span> fetch origin some-branch

<span style="color: #21bfc2;">git</span> checkout some-branch
</pre>
</div>
</section>
<section id="slide-orgefa69b8">
<h4 id="orgefa69b8">pull</h4>
<aside class="notes">
<p>
pull is used to update your local branch with the changes of upstream. this is
used a lot when working in a group and you need to get the changes from
upstream. It fetches from upstream and then merges it into your code. If you
want to rebase instead of merge you can use -r.
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">git</span> pull origin master <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">merges</span>
<span style="color: #21bfc2;">git</span> pull -r origin master <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">rebases</span>
</pre>
</div>

</section>
<section id="slide-orga171a53">
<h3 id="orga171a53">Reverting</h3>
<aside class="notes">
<p>
Oh no we made a mistake in one of our commits and now we have angered all of the
customers. We need to get back to a working commit. first we need to find the
commit and then revert back to it
</p>

</aside>
</section>
<section id="slide-orgbc2f83a">
<h4 id="orgbc2f83a">log</h4>
<aside class="notes">
<p>
the log command shows you a timeline of your code on the commit level you can
then look through and get the unique hash for you to then pass onto the next
command
</p>

<p>
the -p flag provides a &ldquo;diff&rdquo; which shows you the changes in each commit
</p>

</aside>
</section>
