presentations/intro-to/git.tex

\subsubsection*{rebase}
\label{sec:orgcb05308}
\begin{notes}
rebasing rewrites the history of the current branch to incorporate the changes
of the merging branch. this changes the history of the branch which is pretty
dangerous that being said it also makes the code history much more readable
and makes the project history linear. there are no forks to contend with making
it much easier to follow a projects history.

This comes at the cost of safety you are rewriting your history which every time
travel show I have watched has said is a really dangerous thing to do. You also
lose some context provided by the merge commit

as for where to use which. I
recommended you rebase your main branch onto your feature branches and merge your
feature branches into your main. This is what I see happen a lot but this is not
a hard and fast rule
\end{notes}

\begin{verbatim}
git checkout feature
git rebase master # rebase master onto feature

git rebase feature master # samething but one line
\end{verbatim}

\subsection*{Remotes}
\label{sec:org058bd15}
\begin{notes}
We have reached another conundrum all of this code is local. We need a way to
get it out into the world. We could put all of this code in a drop box folder
and share that but I think you know that i am going to show you how to use git
to do that
\end{notes}
\subsubsection*{remote}
\label{sec:orgd460ae6}
\begin{notes}
A remote is an online location for your code. people upload there code to github
or gitlab some people even host there own server. but all are valid remotes

to add one you call the remote add command and provide it with a name and the
url

to change the url call the set-url command

and then rename and remove are self explanatory
\end{notes}

\begin{verbatim}
git remote add <remote_name> https://your.url.here/repo.git

git remote add origin https://github.com/jeetelongname/example.git

git remote set-url origin https://git.sr.ht/~jeetelongnamr/example.git # not real

git remote rename orign upstream

git remote remove upstream
\end{verbatim}

\subsubsection*{push}
\label{sec:org189212c}
\begin{notes}
To send your changes to your new fangled remote you use the push command. it
takes the argument of the remote and the branch to push. when pushing the branch
for the first time you should add the -u flag which tracks the branch

You may need to also overwrite the remote for some reason this is risky as you
could lose work other people push.
\end{notes}

\begin{verbatim}
git push origin master
git push -u origin devel # pusing for the first time
git push origin master --force # overwrite the remote
\end{verbatim}

\subsubsection*{fetch}
\label{sec:org2190dd3}
\begin{notes}
git fetch will download the files from a remote without doing anything with
them. This allows you to look at what other people are doing without
affecting your local copy. you can then merge it into your local copy later if
you wish.

note when you check out \texttt{some-branch} you will be in a detached head state which
means that you can edit all of this and it will not affect your history
\end{notes}

\begin{verbatim}
git fetch origin # fetch all of the branches named origin
git fetch origin some-branch

git checkout some-branch
\end{verbatim}
\subsubsection*{pull}
\label{sec:orgf881a41}
\begin{notes}
pull is used to update your local branch with the changes of upstream. this is
used a lot when working in a group and you need to get the changes from
upstream. It fetches from upstream and then merges it into your code. If you
want to rebase instead of merge you can use -r.
\end{notes}

\begin{verbatim}
git pull origin master # merges
git pull -r origin master # rebases
\end{verbatim}

\subsection*{Reverting}
\label{sec:orged5cb86}
\begin{notes}
Oh no we made a mistake in one of our commits and now we have angered all of the
customers. We need to get back to a working commit. first we need to find the
commit and then revert back to it
\end{notes}
\subsubsection*{log}
\label{sec:orgecca796}
\begin{notes}
the log command shows you a timeline of your code on the commit level you can
then look through and get the unique hash for you to then pass onto the next
command

the -p flag provides a ``diff'' which shows you the changes in each commit
\end{notes}
