presentations/intro-to/git.tex
\subsubsection*{revert}
\label{sec:orgf1e085a}
\begin{notes}
revert takes a hash (or the amount of commits you want to go back from) and will
make a new commit with those changes applied. essentially rolling back to that
commit.

also note you don't need to paste in the entire commit hash you can get away
with the first 5 terms and git will figure out the rest

If that is still too much work you can then use some special syntax to roll back
a certain amount of commits from the current one or the HEAD commit
All its saying is roll back one commit behind head. we can put any number there
but its not really a good solution if you need to go back to a specific commit
\end{notes}

\begin{verbatim}
git revert b4e73eef1e7a1620... # full hash works

git revert b4e73 # also works

git revert HEAD~1 # roll back one commit
\end{verbatim}
\section*{What do you do now?}
\label{sec:orga63d8b9}
\begin{notes}
Well you need to use git. I recommend you try and use git with any and every one
of your projects. I actually used git for my NEA and it helped keep a record of
what I have done and how long it took.

And this is not the only way to use git. most text editors worth there salt have
some sort of git integration and there are usually 3rd party front ends that can
make using git much nicer and faster.
\end{notes}

\section*{Any Questions?}
\label{sec:org0d709e1}
\end{document}
